Repository: davidpovarsky/hanlin-ai
Catalog: AI_HLY/Resource/Localizable.xcstrings
Source language: zh_hans
Languages: en, he

source: 如果您有任何问题或建议，可以通过邮件联系我们。此外，我们有一个微信社群，如果您感兴趣您可以邮件联系我，我将邀请您加入社群。
en: If you have any questions or suggestions, please contact us by email. We also have a WeChat group — email us if you’d like to join.
he: אם יש לך שאלות או הצעות, אנא צור איתנו קשר בדוא"ל. יש לנו גם קבוצת WeChat - שלח לנו דוא"ל אם תרצה להצטרף.

source: 存为知识
en: Save as Knowledge
he: שמירה כידע

source: 存入知识背包
en: Save to Knowledge Backpack
he: שמירה לתיק הידע

source: 学术论文检索
en: Academic Paper Search
he: חיפוש מאמרים אקדמיים

source: 完成
en: Done
he: סיום

source: 密钥
en: API KEY
he: API KEY

source: 对选中内容提出修改意见…
en: Propose revisions for the selected content…
he: הצע תיקונים עבור התוכן שנבחר...

source: 导入聊天记录
en: Import Chat History
he: Import Chat History

source: 导入聊天记录说明
en: Importing Chat History Instructions
he: Importing Chat History Instructions

source: 导入错误
en: Import Error
he: Import Error

source: 导出聊天记录
en: Export Chat History
he: Export Chat History

source: 工具
en: Tools
he: Tools

source: 已下载
en: Downloaded
he: Downloaded

source: 已复制
en: Copied
he: Copied

source: 已成功构建向量
en: Embeddings Ready
he: Embeddings Ready

source: 已添加的模型 (%lld)
en: Added model (%lld)
he: מודלים שנוספו (%lld)

source: 已经写入健康
en: Written to Health
he: Written to Health

source: 已经存入背包
en: Saved to Backpack
he: Saved to Backpack

source: 帮助
en: Help
he: Help

source: 廉价 (≤0.001/千tokens)
en: Cheap (≤¥0.001 / Ktokens)
he: זול (≤¥0.001 / Ktokens)

source: 建议进入其开放平台获取 API 密钥
en: It is recommended to access its open platform to obtain the API key.
he: It is recommended to access its open platform to obtain the API key.

source: 建议进入其开放平台获取API密钥
en: It is recommended to access its open platform to obtain the API key.
he: It is recommended to access its open platform to obtain the API key.

source: 开启智能生活的次世代AI工作台
en: Next-Gen AI Workbench for Smart Living
he: Next-Gen AI Workbench for Smart Living

source: 当前：
en: Current:
he: Current:

source: 当前未启用任何搜索引擎，请前往 设置-工具-搜索设置 中开启。
en: No search engine is currently enabled. Please go to Settings > Tools > Search Settings to enable one.
he: אין מנוע חיפוש מופעל כרגע. אנא עבור אל הגדרות > כלים > הגדרות חיפוש כדי להפעיל אחת.

source: 忘记
en: Forget
he: Forget

source: 快速下载本地模型
en: Quick Download Local Models
he: Quick Download Local Models

source: 思考
en: Thinking
he: Thinking

source: 思考模式可控
en: Controllable Thinking Mode
he: Controllable Thinking Mode

source: 恢复默认排序
en: Restore Default Sorting
he: Restore Default Sorting

source: 您的优化模型已成功更新。
en: Your optimization model has been successfully updated.
he: Your optimization model has been successfully updated.

source: 您的优化模型更新失败！
en: Your optimization model update failed!
he: עדכון מודל האופטימיזציה שלך נכשל!

source: 您的用户信息已成功更新。
en: Your user information has been successfully updated.
he: Your user information has been successfully updated.

source: 您的用户信息更新失败！
en: Your user information update failed!
he: עדכון פרטי המשתמש שלך נכשל!

source: 感谢您使用 Hylic.AI
en: Thank you for using Hylic.AI.
he: Thank you for using Hylic.AI.

source: 成本参考
en: Cost
he: Cost

source: 打开应用的视觉页面
en: Open App’s Visual Page
he: פתח את הדף הוויזואלי של האפליקציה

source: 打开链接
en: Open Link
he: Open Link

source: 拍摄照片
en: Take Photos
he: Take Photos

source: 指引：暂无开启的大模型厂商，点击下方“模型”中的“模型密钥”设置大模型密钥和厂商的启用状态
en: Guidance: No large model providers are currently enabled. Click "Model" below, then "Model Key" to set up the large model key and the provider's enabled status.
he: הדרכה: אין כרגע ספקי דגמים גדולים מופעלים. לחץ על "דגם" למטה ולאחר מכן על "מפתח דגם" כדי להגדיר את מפתח הדגם הגדול ואת הסטטוס המופעל של הספק.

source: 指引：点击下方“优化模型”设置文本优化模型和视觉优化模型，以启用提示词优化、系统消息优化、图片内容识别等功能
en: Instructions: Click "Optimize Model" below to configure the text optimization model and visual optimization model, enabling features such as prompt optimization, system message optimization, and image content recognition.
he: הוראות: לחץ על "בצע אופטימיזציה של מודל" למטה כדי להגדיר את מודל אופטימיזציית הטקסט ואת מודל האופטימיזציה החזותית, המאפשרים תכונות כגון אופטימיזציה מהירה, אופטימיזציה של הודעות מערכת וזיהוי תוכן תמונה.

source: 指引：点击下方“向量模型“设置向量嵌入模型，以启用知识背包检索功能
en: Instructions: Click "Vector Model" below to configure the vector embedding model and enable the knowledge backpack retrieval function.
he: הוראות: לחץ על "מודל וקטור" למטה כדי להגדיר את מודל ההטמעה הווקטורית ולאפשר את פונקציית אחזור תרמיל הידע.

source: 指引：点击下方“工具”中的“联网搜索”设置搜索引擎密钥和需要使用的搜索引擎
en: Guide: Click “Network Search” under “Tools” to set the search engine key and select the search engine to use.
he: מדריך: לחץ על "חיפוש רשת" תחת "כלים" כדי להגדיר את מפתח מנוע החיפוש ובחר את מנוע החיפוש לשימוש.

source: 推荐使用默认系统消息，AI翰林院专为群聊对话模式优化。
en: It is recommended to use the default system message, as AI Hanlin Academy is optimized for group chat dialogue mode.
he: מומלץ להשתמש בהודעת מערכת ברירת המחדל, שכן האקדמיה של AI Hanlin מותאמת למצב דיאלוג צ'אט קבוצתי.

source: 提供者: %@
en: Provider: %@
he: ספק: %@

source: 提示词库
en: Prompt Library
he: Prompt Library

source: 提示词设置
en: Prompt Settings
he: Prompt Settings

source: 搜索引擎选择（最多只能开启一个）
en: Search engine selection (only one)
he: בחירת מנוע חיפוש (אחד לכל היותר)

source: 搜索提示词
en: Search Prompt
he: הנחיית חיפוש

source: 搜索时同时搜索中英文内容
en: Search Both Chinese and English Content
he: חיפוש תוכן בסינית ובאנגלית במקביל

source: 搜索智能体
en: Search Agent
he: סוכן חיפוש

source: 搜索模型
en: Search Model
he: מודל חיפוש

source: 搜索模型...
en: Search model...
he: חיפוש מודל...

source: 搜索知识文档
en: Search Knowledge Documents
he: חיפוש במסמכי ידע

source: 搜索结果数量：%lld
en: Number of Search Results: %lld
he: מספר תוצאות חיפוש: %lld

source: 搜索结果数量（范围：5-20）
en: Number of Search Results (range: 5-20)
he: מספר תוצאות חיפוש (טווח: 5-20)

source: 搜索聊天与消息内容
en: Search chat and message content
he: חיפוש בצ׳אטים ובהודעות

source: 搜索记忆
en: Search Memory
he: חיפוש בזיכרון

source: 摘要文本
en: Summarized Text
he: Summarized Text

source: 撤销填写
en: Undo Fill In
he: Undo Fill In

source: 支持工具使用
en: Support Tool Usage
he: Support Tool Usage

source: 支持文本生成
en: Support Text Generation
he: Support Text Generation

source: 支持深度思考
en: Support Deep Thinking
he: Support Deep Thinking

source: 支持视觉理解
en: Support Visual Understanding
he: Support Visual Understanding

source: 文件文本
en: Document Text
he: Document Text

source: 文本
en: Text
he: Text

source: 文本优化模型
en: Text Optimization Model
he: מודל אופטימיזציית טקסט

source: 文本优化模型将被广泛用于软件的提示词优化、文章内容优化、联网搜索提问优化、知识背包检索优化、图片生成提示词优化、自动生成群聊标题、自动生成智能体设定、翻译文本等功能上，优秀的文本优化模型能带来更好的产品体验。
en: Text optimization models are widely used for prompt & content optimization, online search enhancement, Knowledge Backpack retrieval, image-generation prompting, auto-generating group titles, agent creation, translation, and more. An excellent text-optimization model provides a better user experience.
he: מודלים של אופטימיזציה של טקסט נמצאים בשימוש נרחב עבור אופטימיזציה של הודעות ותוכן, שיפור חיפוש מקוון, אחזור תרמיל ידע, הנחיות ליצירת תמונות, יצירה אוטומטית של כותרות קבוצות, יצירת סוכן, תרגום ועוד. מודל אופטימיזציית טקסט מעולה מספק חווית משתמש טובה יותר.

source: 文本内容生成反馈
en: Text Content Generation Feedback
he: Text Content Generation Feedback

source: 文本模式
en: Markdown
he: Markdown

source: 新增
en: Add
he: Add

source: 新增提醒事项
en: Add New Reminder
he: Add New Reminder

source: 新增日历事件
en: Add Calendar Events
he: Add Calendar Events

source: 新增自定义供应商
en: Add Custom Supplier
he: Add Custom Supplier

source: 方形画幅
en: Square Format
he: Square Format

source: 无可用模型
en: No available models.
he: אין מודלים זמינים.

source: 无法使用视觉功能
en: Unable to use visual features.
he: Unable to use visual features.

source: 无法开启厂商
en: Unable to Enable Vendor
he: Unable to Enable Vendor

source: 无法新建对话
en: Unable to create a new conversation.
he: לא ניתן ליצור שיחה חדשה

source: 日历提醒
en: Calendar & Reminder
he: לוח שנה ותזכורת

source: 昂贵 (≥0.006/千tokens)
en: Expensive (≥¥0.006 / Ktokens)
he: יקר (≥¥0.006 / Ktokens)

source: 是否要删除所有聊天记录？删除后不可恢复。
en: Do you want to delete all chat history? Once deleted, it cannot be recovered.
he: האם אתה רוצה למחוק את כל היסטוריית הצ'אט? לאחר המחיקה, לא ניתן לשחזר אותו.

source: 显示名称（自定义）
en: Display Name (Custom)
he: שם תצוגה (מותאם אישית)

source: 显示设置
en: Display Settings
he: Display Settings

source: 智能体
en: Agent
he: Agent

source: 智能体名称
en: Agent Name
he: Agent Name

source: 智能体设定
en: Agent Settings
he: Agent Settings

source: 暂无可用模型
en: No available models
he: אין מודלים זמינים

source: 暂无可用模型，请前往模型界面开启模型。
en: No models available. Please go to the models interface to enable a model.
he: No models available. Please go to the models interface to enable a model.

source: 暂无启用的多模态模型，请前往“设置-模型-模型管理”添加并启用支持视觉的模型。
en: No multimodal models are currently enabled. Please go to "Settings - Models - Model Management" to add and enable models that support vision.
he: אין כרגע מודלים מולטימודליים פעילים. עברו אל "הגדרות-מודלים-ניהול מודלים" כדי להוסיף ולהפעיל מודלים שתומכים בראייה.

source: 暂无消息
en: No Messages Yet
he: No Messages Yet

source: 暂无翻译记录
en: No translation record
he: No translation record

source: 更新
en: Update
he: Update

source: 更新时间：%@
en: Updated: %@
he: Updated: %@

source: 更新说明
en: Update Notes
he: Update Notes

source: 未启用搜索引擎
en: No Search Engine Enabled
he: לא הופעל מנוע חיפוש

source: 未来天气预报
en: Future Weather Forecast
he: Future Weather Forecast

source: 本地
en: Local
he: Local

source: 本地模型(Beta)
en: Local Models (Beta)
he: מודלים מקומיים (Beta)

source: 本地模型还属于测试阶段，暂不支持视觉功能等，输出也可能存在问题，将在后期修复优化。如果下载后需要删除，可以直接在模型列表进行删除，本地文件会随之一起删除。模型文件来自于魔塔社区或HuggingFace，本软件对模型输出结果不负有任何责任。请结合自己的设备性能合理下载，若超出设备承受能力，可能会出现闪退、卡死等现象。
en: The local model is still in the testing phase and does not currently support visual functions, and there may be issues with the output that will be fixed and optimized later. If you need to delete it after downloading, you can do so directly from the model list, and the local files will be deleted as well. The model files come from the Mo Tower community or Hugging Face, and this software assumes no responsibility for the output results of the models. Please download reasonably based on your device's performance; exceeding your device's capacity may result in crashes or freezes.
he: המודל המקומי עדיין בשלב הבדיקה ואינו תומך כרגע בפונקציות חזותיות, וייתכנו בעיות בפלט שיתוקנו ויוטבו בהמשך. אם אתה צריך למחוק אותו לאחר ההורדה, אתה יכול לעשות זאת ישירות מרשימת הדגמים, וגם הקבצים המקומיים יימחקו. קבצי המודל מגיעים מקהילת Mo Tower או Hugging Face, ותוכנה זו אינה לוקחת אחריות על תוצאות הפלט של הדגמים. אנא הורד באופן סביר בהתבסס על ביצועי המכשיר שלך; חריגה מהקיבולת של המכשיר שלך עלולה לגרום לקריסות או להקפאה.

source: 本地运行
en: Run Locally
he: Run Locally

source: 本软件对生成结果不负有任何责任
en: The software is not responsible for the generated results.
he: The software is not responsible for the generated results.

source: 构建以允许聊天召回
en: Build for Chat Recall
he: Build for Chat Recall

source: 查找提醒事项
en: Find Reminders
he: Find Reminders

source: 查找日历事件
en: Find Calendar Events
he: Find Calendar Events

source: 查看源码
en: Source Code
he: Source Code

source: 查看资料
en: Read Information
he: Read Information

source: 查询 API 余额
en: Check API Balance
he: בדיקת יתרת API

source: 查询实时天气
en: Check Real-time Weather
he: Check Real-time Weather

source: 查询步数距离
en: Query Step Distance
he: Query Step Distance

source: 查询能量消耗
en: Query Energy Consumption
he: Query Energy Consumption

source: 查询营养摄入
en: Enquire Nutritional Intake
he: Enquire Nutritional Intake

source: 标题
en: Title
he: Title

source: 格式规范
en: Formatting Standards
he: Formatting Standards

source: 模型
en: Models
he: מודלים

source: 模型厂商
en: Model Vendors
he: ספקי מודלים

source: 模型名称
en: Model Name
he: שם המודל

source: 模型名称已存在，请修改名称后重试。
en: The model name already exists, please modify the name and try again.
he: שם הדגם כבר קיים, אנא שנה את השם ונסה שוב.

source: 模型在需要时主动搜索
en: Models actively search when needed
he: Models actively search when needed

source: 模型在需要时主动翻找知识背包
en: The model actively searches through its knowledge base when needed.
he: The model actively searches through its knowledge base when needed.

source: 模型应该怎么称呼你？
en: How Should Models Address You?
he: כיצד צריכות דוגמניות לפנות אליך?

source: 模型显示方式
en: Model Display Mode
he: Model Display Mode

source: 模型管理
en: Model Management
he: ניהול מודלים

source: 模型能力自动探测
en: Automatic Model Capability Detection
he: Automatic Model Capability Detection

source: 模型选择
en: Model Selection
he: בחירת מודל

source: 模型需要注意什么？
en: What Should Be Noted About Models?
he: מה צריך לשים לב לגבי דגמים?

source: 横向滑动
en: Slide horizontally
he: החלק אופקית

source: 横向画幅
en: Horizontal format
he: Horizontal format

source: 正在加载...
en: Loading...
he: טוען...

source: 正在填写
en: Filling in…
he: ממלא…

source: 正在翻译
en: Translating...
he: Translating...

source: 正在获取模型列表...
en: Fetching model list...
he: Fetching model list...

source: 正在请求
en: Requesting...
he: Requesting...

source: 此操作会清空当前画布内容，无法撤销。
en: This operation will clear the current canvas content and cannot be undone.
he: This operation will clear the current canvas content and cannot be undone.

source: 注意：用户信息的设置会让模型的回复更符合你的习惯，但是会消耗更多的tokens。
en: Note: Setting user information will make model responses more tailored to your preferences but will consume more tokens.
he: Note: Setting user information will make model responses more tailored to your preferences but will consume more tokens.

source: 注意：自动模型能力探测中可能有一定的API费用消耗
en: Note: API fees may be incurred during automatic model capability detection.
he: Note: API fees may be incurred during automatic model capability detection.

source: 测试 API
en: Test API
he: בדיקת API

source: 测试失败
en: Test Failed
he: Test Failed

source: 测试模型
en: Test Model
he: Test Model

source: 测试通过
en: Test Passed
he: Test Passed

source: 消息
en: Message
he: Message

source: 消息数量上限
en: Message Quantity Limit
he: Message Quantity Limit

source: 润色文本
en: Refine Text
he: Refine Text

source: 润色要求
en: Refinement Requirements
he: Refinement Requirements

source: 深度思考
en: Deep Thinking
he: Deep Thinking

source: 添加
en: Add
he: Add

source: 添加在线模型
en: Add Online Model
he: הוספת מודל מקוון

source: 添加新智能体
en: Add New Agent
he: Add New Agent

source: 添加智能体
en: Add New Agent
he: Add New Agent

source: 添加本地模型
en: Add Local Models
he: הוספת מודלים מקומיים

source: 添加自定义 API 供应商，使用兼容 OpenAI 格式的 API 服务
en: Add a custom API provider that uses an API service compatible with the OpenAI format.
he: Add a custom API provider that uses an API service compatible with the OpenAI format.

source: 清空
en: Clear All
he: Clear All

source: 清空所有
en: Clear All
he: Clear All

source: 清空聊天记录
en: Clear Chat History
he: Clear Chat History

source: 清除
en: Clear
he: Clear

source: 温馨提示：即时功能不会保存你的数据，重要数据请及时备份！
en: Reminder: Instant features do not save your data. Please back up important information in time!
he: תזכורת: תכונות מיידיות אינן שומרות את הנתונים שלך. נא לגבות מידע חשוב בזמן!

source: 渲染画布网页
en: Render Canvas Webpage
he: Render Canvas Webpage

source: 渲染网页内容
en: Render Web Content
he: Render Web Content

source: 灌输新记忆
en: Instill New Memories
he: Instill New Memories

source: 点击右下角“画布”按钮以查看和编辑内容
en: Click the "Canvas" button at the bottom right to view and edit content.
he: לחץ על כפתור "קנבס" בפינה השמאלית התחתונה כדי להציג ולערוך תוכן.

source: 点击名称或钥匙设置厂商密钥，并打开厂商开关以使用该厂商的模型
en: Click the name or key to set the manufacturer's key, and turn on the manufacturer switch to use the manufacturer's model.
he: לחץ על השם או המקש כדי להגדיר את מפתח היצרן, והפעל את מתג היצרן כדי להשתמש בדגם היצרן.

source: 版本：%@
en: Version: %@
he: Version: %@

source: 特别要求
en: Special Requests
he: Special Requests

source: 特定位置搜索
en: Specific Location Search
he: חיפוש במיקום מסוים

source: 现有文本或网页链接
en: Existing Text or Web Links
he: Existing Text or Web Links

source: 生图
en: Generate Image
he: Generate Image

source: 生成语音
en: Generate Speech
he: Generate Speech

source: 用户信息
en: User Information
he: User Information

source: 用户定位查询
en: User Location Search
he: User Location Search

source: 由 %@ 提供润色
en: Refinement Provided by %@
he: Refinement Provided by %@

source: 由 %@ 提供翻译
en: Translation Provided by %@
he: Translation Provided by %@

source: 由 %@ 进行摘要
en: Summarized by %@
he: Summarized by %@

source: 由于需要拷贝模型文件，上传后根据上传的模型大小，等待一段时间后才会在数据库中看见上传的本地模型。
en: Due to the need to copy model files, after uploading, you will see the uploaded local model in the database only after waiting for a while based on the size of the uploaded model.
he: עקב הצורך בהעתקת קבצי דגם, לאחר ההעלאה, תראה את הדגם המקומי שהועלה במאגר רק לאחר המתנה של זמן מה בהתאם לגודל הדגם שהועלה.

source: 画布 %@
en: Canvas %@
he: Canvas %@

source: 百位AI翰林待诏候旨，作为智能时代的掌玺者，您将在21世纪最澎湃的算力浪潮中，见证思维内阁呈递的万方策论。而你，21世纪最富期待的科技革命的亲历者，AI翰林院诚邀您检阅百模智囊团，在史无前例的认知盛宴中，谱写您那属于数字时代的新华章！
en: A hundred AI scholars stand by, awaiting your command. As the keeper of the imperial seal in the era of intelligence, you will witness the grand strategies presented by the Cabinet of Thought amidst the most surging tide of computational power in the 21st century. And you, the most eagerly anticipated pioneer of this century’s technological revolution, are cordially invited by the AI Academy to review the wisdom of a hundred models. In this unprecedented cognitive feast, let us compose a new chapter that belongs to you in the digital age!
he: מאה חוקרי בינה מלאכותית עומדים מנגד, ממתינים לפקודתך. בתור שומר החותם הקיסרי בעידן המודיעין, אתה תהיה עד לאסטרטגיות הגדולות שהציג קבינט המחשבה בתוך הגאות הגואה ביותר של כוח חישוב במאה ה-21. ואתה, החלוץ המצופה ביותר במהפכה הטכנולוגית של המאה הנוכחית, מוזמן באהבה על ידי האקדמיה לבינה מלאכותית לסקור את החוכמה של מאה דגמים. בחגיגה קוגניטיבית חסרת תקדים זו, הרשו לנו לחבר פרק חדש ששייך לכם בעידן הדיגיטלי!

source: 相册选择
en: Camera Selection
he: Camera Selection

source: 知识库
en: Knowledge
he: מאגר ידע

source: 知识文档撰写
en: Knowledge Document Creation
he: כתיבת מסמך ידע

source: 知识背包
en: Knowledge Backpack
he: תיק ידע

source: 知识背包翻找
en: Knowledge Backpack Search
he: חיפוש בתיק הידע

source: 知识背包错误
en: Knowledge Backpack Error
he: שגיאת תיק ידע

source: 确定
en: Confirm
he: אישור

source: 确定要删除吗？删除后不可恢复！
en: Are you sure you want to delete it? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק אותו? לא ניתן לבטל פעולה זו.

source: 确定要删除此模型吗？
en: Are You Sure You Want to Delete This Model?
he: האם אתה בטוח שאתה רוצה למחוק את הדגם הזה?

source: 确定要清除所有记忆吗？
en: Are you sure you want to clear all memories?
he: האם אתה בטוח שאתה רוצה לנקות את כל הזכרונות?

source: 确认删除？
en: Confirm Deletion?
he: לאשר את המחיקה?

source: 确认删除画布内容？
en: Confirm deletion of canvas content?
he: לאשר מחיקה של תוכן בד?

source: 确认清空所有文本？
en: Confirm Clearing All Text?
he: לאשר את ניקוי כל הטקסט?

source: 确认清空聊天记录
en: Confirm Clearing Chat History
he: Confirm Clearing Chat History

source: 视觉
en: Vision
he: ראייה

source: 视觉优化模型
en: Visual Optimization Model
he: מודל אופטימיזציית ראייה

source: 视觉优化模型将被广泛用于软件的联网搜索提问优化、知识背包检索优化、图片生成提示词优化、OCR扫描文本、文本及推理模型分析图片等功能上，优秀的视觉优化模型能带来更好的产品体验。
en: Visual optimization models are widely used for online search query optimization, Knowledge Backpack retrieval, image-generation prompts, OCR text scanning, and image analysis with text & reasoning. High-quality visual optimization models deliver a superior user experience.
he: מודלים של אופטימיזציה חזותית נמצאים בשימוש נרחב עבור אופטימיזציה של שאילתות חיפוש מקוונות, אחזור תרמיל ידע, הנחיות ליצירת תמונות, סריקת טקסט OCR וניתוח תמונה עם טקסט והיגיון. מודלים של אופטימיזציה חזותית באיכות גבוהה מספקים חווית משתמש מעולה.

source: 禁用工具
en: Disable Tools
he: Disable Tools

source: 科学模式
en: Latex
he: Latex

source: 程序源码
en: Source Code
he: Source Code

source: 程序运行结果
en: Program Results
he: Program Results

source: 系统名称（用于API请求，参考官方API）
en: System Name (For API Requests, Refer to Official API)
he: שם מערכת (עבור בקשות API, עיין ב-API הרשמי)

source: 系统消息设置
en: System Message Settings
he: System Message Settings

source: 约 %lld tokens
en: Approx. %lld tokens
he: Approx. %lld tokens

source: 纯文本
en: Plain Text
he: Plain Text

source: 纯文本 (.txt)
en: Plain Text (.txt)
he: טקסט רגיל (.txt)

source: 纵向画幅
en: Vertical
he: Vertical

source: 累积概率参数调节 (top_p)
en: Cumulative Probability Adjustment (top_p)
he: התאמת הסתברות מצטברת (top_p)

source: 继续
en: Continue
he: Continue

source: 编辑
en: Edit
he: עריכה

source: 编辑 System 角色消息
en: Edit System Role Message
he: Edit System Role Message

source: 编辑内容
en: Edit Content
he: Edit Content

source: 编辑图标
en: Edit Icon
he: עריכת סמל

source: 编辑基础模型
en: Edit the Basic Model
he: Edit the Basic Model

source: 编辑密钥
en: Edit API Key
he: עריכת API Key

source: 编辑智能体
en: Edit Agent
he: Edit Agent

source: 编辑智能体名称
en: Edit Agent Name
he: Edit Agent Name

source: 编辑智能体描述
en: Edit Agent Description
he: Edit Agent Description

source: 编辑智能体设定
en: Edit Agent Character
he: Edit Agent Character

source: 编辑标题
en: Edit Title
he: Edit Title

source: 编辑模型
en: Edit Model
he: Edit Model

source: 编辑模型名称
en: Edit Model Name
he: Edit Model Name

source: 编辑画布内容
en: Edit Canvas Contents
he: Edit Canvas Contents

source: 编辑翻译
en: Edit Translation
he: Edit Translation

source: 编辑翻译词汇
en: Edit Translation
he: Edit Translation

source: 编辑聊天记录
en: Edit Chat History
he: Edit Chat History

source: 网络文件阅读
en: Online Document Reading
he: Online Document Reading

source: 网页信息阅读
en: Web Content Reading
he: Web Content Reading

source: 网页地址
en: Web URL
he: Web URL

source: 置顶消息
en: Pin Message
he: הצמדת הודעה

source: 置顶知识
en: Pin Knowledge
he: הצמדת ידע

source: 翻找结果数量：%lld
en: Number of Search Results: %lld
he: מספר תוצאות חיפוש: %lld

source: 翻找结果数量（范围：5-20）
en: Number of Search Results (range: 5-20)
he: מספר תוצאות חיפוש (טווח: 5-20)

source: 翻译中...
en: Translating...
he: Translating...

source: 翻译内容
en: Translation Content
he: Translation Content

source: 翻译操作失败
en: Translation Failed
he: Translation Failed

source: 翻译词典
en: Translation Dictionary
he: Translation Dictionary

source: 聊天记录管理
en: Chat Record Management
he: Chat Record Management

source: 联系我们
en: Contact Us
he: Contact Us

source: 联网信息检索
en: Network Information Retrieval
he: אחזור מידע מהרשת

source: 联网搜索
en: Network Search
he: חיפוש ברשת

source: 自动填写
en: Autofill
he: Autofill

source: 自动模型能力探测
en: Automatic model capability detection
he: Automatic model capability detection

source: 自动路线规划
en: Automatic Route Planning
he: Automatic Route Planning

source: 自定义
en: Customization
he: Customization

source: 自定义系统消息
en: Custom System Message
he: Custom System Message

source: 自定义翻译词典将使得“即时翻译”的翻译结果变得更加个性化，特别是对于某些私有化的翻译知识而言，在翻译词典中添加搭配能最快速的优化你的翻译结果。
en: Setting up a translation dictionary will make the results of "instant translation" more personalized, especially for certain proprietary translation knowledge. Adding collocations to the translation dictionary can quickly optimize your translation results.
he: הגדרת מילון תרגום תהפוך את התוצאות של "תרגום מיידי" לאישיות יותר, במיוחד עבור ידע תרגום קנייני מסוים. הוספת קולוקציות למילון התרגום יכולה לייעל במהירות את תוצאות התרגום שלך.

source: 菜单选择
en: Menu Selection
he: Menu Selection

source: 营养卡片
en: Nutrition Card
he: Nutrition Card

source: 补全 /v1/chat/completions
en: Complete /v1/chat/completions
he: Complete /v1/chat/completions

source: 要求描述...
en: Request Description…
he: בקש תיאור...

source: 规划执行
en: Planning
he: Planning

source: 触感反馈
en: Haptic Feedback
he: Haptic Feedback

source: 记忆功能已关闭
en: Memory function has been disabled.
he: Memory function has been disabled.

source: 记忆档案
en: Memory Archive
he: Memory Archive
